**`teams/nomis/windows_server_2019_jumpserver`** terragrunt plan on `push` event [#923](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.1/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: jumpserver_2019
            description: Jumpserver provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 1.0.1
          +       default: 1.0.2
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: ConfigureJava
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $S3_BUCKET = "ec2-image-builder-nomis20220314103938567000000001"
            
                          # Download/Install Java
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/jre-6u33-windows-i586.exe -File C:\jumpserver-software\jre-6u33-windows-i586.exe
                          Start-Process -Wait -FilePath "C:\jumpserver-software\jre-6u33-windows-i586.exe" -ArgumentList "/qn", "/s", "/v" -PassThru -RedirectStandardOutput "C:\jumpserver-software\jre-install.log"
            
                          # Copy deployment config files
                          $deployment_folder = "C:\Windows\Sun\Java\Deployment"
                          New-Item -Path $deployment_folder -ItemType Directory -Force
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.config -File $deployment_folder\deployment.config
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.properties -File $deployment_folder\deployment.properties
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/trusted.certs -File $deployment_folder\trusted.certs
            
                          # Prevent Java update check
                          Remove-ItemProperty -Path "HKLM:\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion\Run" -Name SunJavaUpdateSched -Force -ErrorAction SilentlyContinue
                  - name: ConfigureTrustedSites
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          # Add Nomis sites to trusted sites
                          $sites = @(
                              "*.nomis.hmpps-test.modernisation-platform.internal"
                              "*.nomis.hmpps-test.modernisation-platform.justice.gov.uk"
                              "*.nomis.hmpps-production.modernisation-platform.internal"
                              "*.nomis.hmpps-production.modernisation-platform.justice.gov.uk"
                              "*.modernisation-platform.nomis.az.justice.gov.uk"
                          )
            
                          $paths = @(
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains"
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\EscDomains"
                          )
            
                          foreach($path in $paths){
                            $sites | ForEach-Object {
                                New-Item -Path $path\$_ -Force
                                New-ItemProperty -Path $path\$_ -Name http -Value 2 -PropertyType DWORD -Force
                                New-ItemProperty -Path $path\$_ -Name https -Value 2 -PropertyType DWORD -Force
                            }
                          }
            
                          # Use Local Machine settings for Internet Security Settings
                          $reg_path = "HKLM:\Software\Policies\Microsoft\Windows\CurrentVersion\Internet Settings"
                          New-Item -Path $reg_path -Force
                          New-ItemProperty -Path $reg_path -Name Security_HKLM_only -Value 1 -PropertyType DWORD -Force
                  - name: ConfigureSQLDeveloper
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $S3_BUCKET = "ec2-image-builder-nomis20220314103938567000000001"
            
                          # Download SQL Developer
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/sqldeveloper-22.2.1.234.1810-x64.zip -File C:\jumpserver-software\sqldeveloper-22.2.1.234.1810-x64.zip
          -               
          + 
                          # Extract SQL Developer - there is no installer for this application
                          Expand-Archive -Path C:\jumpserver-software\sqldeveloper-22.2.1.234.1810-x64.zip -DestinationPath "C:\Program Files\Oracle"
            
                          # Create a desktop shortcut
                          $shortcut = New-Object -ComObject WScript.Shell
                          $shortcut_link = $shortcut.CreateShortcut("C:\Users\Public\Desktop\SQL Developer.lnk")
                          $shortcut_link.TargetPath = "C:\Program Files\Oracle\sqldeveloper\sqldeveloper.exe"
                          $shortcut_link.Save()
        EOT
      ~ date_created          = "2023-04-24T12:01:58.011Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.1/1" -> (known after apply)
        name                  = "jumpserver_2019"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "branch"                                  = "nomis/DSOS-1865/windows-jumpserver-prerequisites" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "is-production"                           = "false" -> "true"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
          ~ "release-or-patch"                        = "test" -> "release"
            # (8 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                                  = "nomis/DSOS-1865/windows-jumpserver-prerequisites" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "is-production"                           = "false" -> "true"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
          ~ "release-or-patch"                        = "test" -> "release"
            # (8 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.0.1" -> "1.0.2" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2019-jumpserver"
        name         = "nomis_windows_server_2019_jumpserver"
      ~ tags         = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
            # (11 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Windows Server 2019 jumpserver"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2019-jumpserver"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "nomis_windows_server_2019_jumpserver"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.4"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.4"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.2"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all                         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.4"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.4"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.2"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2019-jumpserver/0.0.2" -> (known after apply)
      ~ date_created      = "2023-04-24T12:08:56.841Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2019-jumpserver/0.0.2" -> (known after apply)
        name              = "nomis_windows_server_2019_jumpserver"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          ~ "branch"                                  = "nomis/DSOS-1865/windows-jumpserver-prerequisites" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "is-production"                           = "false" -> "true"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
          ~ "release-or-patch"                        = "test" -> "release"
            # (8 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "branch"                                  = "nomis/DSOS-1865/windows-jumpserver-prerequisites" -> "main"
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.2" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "is-production"                           = "false" -> "true"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
          ~ "release-or-patch"                        = "test" -> "release"
            # (8 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.2" -> "0.0.4" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.1/1" -> (known after apply) # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-3" -> (known after apply)
      ~ date_created                  = "2023-04-24T15:41:43.065Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-3" -> (known after apply)
      ~ name                          = "nomis_windows_server_2019_jumpserver_0_0_3" -> "nomis_windows_server_2019_jumpserver_0_0_4" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
            # (11 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
            # (11 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.3" -> "nomis_windows_server_2019_jumpserver/0.0.4"
          ~ "jumpserver_2019-version"                 = "1.0.1" -> "1.0.2"
            # (11 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 3 to destroy.

```
